Конфигурация/Проверка/Documents/КассоваяСмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>КассоваяСмена</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКассовойСмены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЧекиККМ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Касса</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧекККМ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФискальныеЧеки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФОП</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФОП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФискальныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФискальныйЧек</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ФискальныйЧек</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОперации</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыОперацийФискальногоЧека</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Проверка/Enums/СтатусыКассовойСмены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыКассовойСмены</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Открыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Проверка/Documents/КассоваяСмена/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Обязательные поля
	МассивНепроверяемых = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(ДатаНачала) Тогда
		ТекстСообщения = "Поле ""Дата начала"" должно быть заполнено.";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "ДатаНачала",, Отказ);
	КонецЕсли;
	
	// Если смена закрыта, дата окончания обязательна
	Если Статус = Перечисления.СтатусыКассовойСмены.Закрыта И НЕ ЗначениеЗаполнено(ДатаОкончания) Тогда
		ТекстСообщения = "Для закрытой смены поле ""Дата окончания"" должно быть заполнено.";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "ДатаОкончания",, Отказ);
	КонецЕсли;
	
	// Дата окончания не может быть раньше даты начала
	Если ЗначениеЗаполнено(ДатаНачала) И ЗначениеЗаполнено(ДатаОкончания) Тогда
		Если ДатаОкончания < ДатаНачала Тогда
			ТекстСообщения = "Дата окончания смены не может быть раньше даты начала.";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "ДатаОкончания",, Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Контроль уникальности: не более одной открытой смены
	Если Статус = Перечисления.СтатусыКассовойСмены.Открыта Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	КассоваяСмена.Ссылка КАК Ссылка,
			|	КассоваяСмена.Номер КАК Номер
			|ИЗ
			|	Документ.КассоваяСмена КАК КассоваяСмена
			|ГДЕ
			|	КассоваяСмена.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)
			|	И КассоваяСмена.Ссылка <> &ТекущаяСсылка
			|	И НЕ КассоваяСмена.ПометкаУдаления";
		
		Запрос.УстановитьПараметр("ТекущаяСсылка", Ссылка);
		
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			ТекстСообщения = СтрШаблон(
				"Уже существует открытая смена № %1. Закройте её перед открытием новой.",
				Выборка.Номер);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Закрывает кассовую смену
//
// Параметры:
//  ДатаЗакрытия - Дата - Дата и время закрытия смены
//
Процедура ЗакрытьСмену(ДатаЗакрытия = Неопределено) Экспорт
	
	Если Статус = Перечисления.СтатусыКассовойСмены.Закрыта Тогда
		ВызватьИсключение "Смена уже закрыта!";
	КонецЕсли;
	
	Если ДатаЗакрытия = Неопределено Тогда
		ДатаЗакрытия = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ЭтотОбъект.ДатаОкончания = ДатаЗакрытия;
	ЭтотОбъект.Статус = Перечисления.СтатусыКассовойСмены.Закрыта;
	
	Попытка
		ЭтотОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ВызватьИсключение СтрШаблон("Ошибка при закрытии смены: %1", ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
